//------------------------------------------------------------------------------
// plane_In.cpp - содержит процедуру ввода параметров
// для уже созданного самолёта
//------------------------------------------------------------------------------

#include "plane.h"

//------------------------------------------------------------------------------
// Ввод параметров самолёта из файла
void In(plane &pl, ifstream &ifst) {
    ifst >> pl.range >> pl.lifting_capacity;
}

// Случайный ввод параметров самолёта
void InRnd(plane &pl) {
    pl.range = Random() % 101 + 10;
    pl.lifting_capacity = Random() % 101 + 5;
}

//------------------------------------------------------------------------------
// Вывод параметров самолёта в форматируемый поток
void Out(plane &r, ofstream &ofst) {
    ofst << "It is Plane: Range = " << r.range << ", lifting capacity = " << r.lifting_capacity
         << ". Perfect time = " << getPerfectTime(r) << "\n";
}

